<a href="https://colab.research.google.com/github/HaJunYoo/Programmers_DE_Start/blob/main/(DE_11%EA%B8%B0)_1%EC%A3%BC%EC%B0%A8_SQL_%EC%8B%A4%EC%8A%B5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

주피터 SQL 엔진 설정

In [21]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [22]:
# ID와 PW를 자신의 환경에 맞게 수정
%sql postgresql://guest:Guest1234@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev

'Connected: guest@dev'

다양한 SELECT 실행해보기

In [6]:
%%sql SELECT *
FROM raw_data.user_session_channel
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(1651, '0004289ee1c7b8b08c77e19878106ae3', 'Organic'),
 (1197, '00053f5e11d1fe4e49a221165b39abc9', 'Facebook'),
 (1401, '00056c20eb5a029583db75506953f1d9', 'Facebook'),
 (1399, '00063cb5da1826febf178b669eea3250', 'Facebook'),
 (1667, '000958fdaefe0dd06f5d7c4e4a5f28d1', 'Instagram'),
 (468, '000a3f777828d2cdbee98887561aa130', 'Facebook'),
 (1563, '000cb7efa8a05429dd5309b4bea2eb0c', 'Naver'),
 (711, '00106ac9184e7d54b570d0f0cb0c38b2', 'Organic'),
 (473, '0011df6282fe8cf78feeab676fbc3c27', 'Naver'),
 (420, '00126b47d5502dfb7d01f750ad23d813', 'Facebook')]

In [7]:
%%sql

# 칼럼 수 세기 count(1) == count(*)
SELECT COUNT(1)
FROM raw_data.session_timestamp;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(101520,)]

In [8]:
%%sql

SELECT * 
FROM raw_data.session_timestamp
LIMIT 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[('00029153d12ae1c9abe59c17ff2e0895', datetime.datetime(2019, 10, 18, 14, 14, 5, 100000))]

In [9]:
%%sql

# ts = 날짜
SELECT DATE(ts) yearmonthday, sessionID
FROM raw_data.session_timestamp
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 18), '00029153d12ae1c9abe59c17ff2e0895'),
 (datetime.date(2019, 11, 16), '0004289ee1c7b8b08c77e19878106ae3'),
 (datetime.date(2019, 8, 10), '0006246bee639c7a7b11a08e34dd3cc6'),
 (datetime.date(2019, 7, 6), '0006dd05ea1e999ddaa041a7091b7b36'),
 (datetime.date(2019, 11, 2), '000958fdaefe0dd06f5d7c4e4a5f28d1'),
 (datetime.date(2019, 11, 29), '000a3f777828d2cdbee98887561aa130'),
 (datetime.date(2019, 7, 17), '000a91f3e374e6147d58ed1814247508'),
 (datetime.date(2019, 7, 23), '000cb7efa8a05429dd5309b4bea2eb0c'),
 (datetime.date(2019, 8, 21), '000d0c74074191add6f22e0004db8f76'),
 (datetime.date(2019, 9, 21), '000d54aadcedee0739d39127955f2cdb')]

In [12]:
%%sql

SELECT DATE(ts) as yearmonthday, sessionID
FROM raw_data.session_timestamp
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 18), '00029153d12ae1c9abe59c17ff2e0895'),
 (datetime.date(2019, 11, 16), '0004289ee1c7b8b08c77e19878106ae3'),
 (datetime.date(2019, 8, 10), '0006246bee639c7a7b11a08e34dd3cc6'),
 (datetime.date(2019, 7, 6), '0006dd05ea1e999ddaa041a7091b7b36'),
 (datetime.date(2019, 11, 2), '000958fdaefe0dd06f5d7c4e4a5f28d1'),
 (datetime.date(2019, 11, 29), '000a3f777828d2cdbee98887561aa130'),
 (datetime.date(2019, 7, 17), '000a91f3e374e6147d58ed1814247508'),
 (datetime.date(2019, 7, 23), '000cb7efa8a05429dd5309b4bea2eb0c'),
 (datetime.date(2019, 8, 21), '000d0c74074191add6f22e0004db8f76'),
 (datetime.date(2019, 9, 21), '000d54aadcedee0739d39127955f2cdb')]

In [13]:
%%sql

-- 날짜 내림차순으로 10개 세션 아이디
SELECT DATE(ts) date, sessionID
FROM raw_data.session_timestamp
ORDER BY ts desc
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 11, 30), '6309ff4befccf8ba77b16141fab763c6'),
 (datetime.date(2019, 11, 30), '42daed3b750cc5c6270636fddee0486d'),
 (datetime.date(2019, 11, 30), '398c674511e98d3e9bd40ba5bfa67af8'),
 (datetime.date(2019, 11, 30), '1e65c9f788d6382abc0ee60886e7fa4a'),
 (datetime.date(2019, 11, 30), 'ec6d363a01a8a0691d24b8556bc1fb61'),
 (datetime.date(2019, 11, 30), '8f48bd8292fc4540404dc9dae06175e6'),
 (datetime.date(2019, 11, 30), '89a76004709bb668a8aefb6306a6aed1'),
 (datetime.date(2019, 11, 30), '9cfaefd1e81f637fad6330ff16eb1f39'),
 (datetime.date(2019, 11, 30), 'bbf2f1c020c5e39734c73223784bd7b4'),
 (datetime.date(2019, 11, 30), 'bac82af401b714e895c9c46af11f76ea')]

In [16]:
%%sql

-- 날짜 별 그룹 세션 아이디 
SELECT DATE(ts) date, COUNT(sessionID) -- COUNT(1)
FROM raw_data.session_timestamp
-- 첫번째 이름으로 그룹화
GROUP BY 1 
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 18), 630),
 (datetime.date(2019, 7, 6), 435),
 (datetime.date(2019, 11, 2), 556),
 (datetime.date(2019, 7, 23), 526),
 (datetime.date(2019, 8, 1), 499),
 (datetime.date(2019, 10, 12), 619),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 6), 610),
 (datetime.date(2019, 9, 13), 543),
 (datetime.date(2019, 8, 18), 529)]

In [17]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 23), 678),
 (datetime.date(2019, 11, 13), 671),
 (datetime.date(2019, 11, 12), 668),
 (datetime.date(2019, 10, 11), 665),
 (datetime.date(2019, 10, 29), 660),
 (datetime.date(2019, 10, 21), 653),
 (datetime.date(2019, 11, 5), 652),
 (datetime.date(2019, 11, 11), 651),
 (datetime.date(2019, 10, 14), 648),
 (datetime.date(2019, 11, 7), 645)]

In [19]:
%%sql

SELECT DATE(ts) date, COUNT(sessionID)
FROM raw_data.session_timestamp
GROUP BY 1
ORDER BY 1
LIMIT 10; -- DESC

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

JOIN에 대해 배워보자. 일별 방문 유니크한 사용자의 수를 계산하고 싶다면?

In [23]:
# 일별 방문 유니크한 사용자의 수를 계산
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql

SELECT DATE(st.ts) date, COUNT(usc.userID) -- 세션수 카운트와 동일. COUNT(NULL): 0, 그 이외의 모든 경우는 1을 리턴
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 5, 1), 147),
 (datetime.date(2019, 5, 2), 161),
 (datetime.date(2019, 5, 3), 150),
 (datetime.date(2019, 5, 4), 142),
 (datetime.date(2019, 5, 5), 144),
 (datetime.date(2019, 5, 6), 164),
 (datetime.date(2019, 5, 7), 180),
 (datetime.date(2019, 5, 8), 161),
 (datetime.date(2019, 5, 9), 169),
 (datetime.date(2019, 5, 10), 176)]

In [24]:
# raw_data.user_session_channel과 raw_data.session_timestamp 테이블의 조인이 필요
%%sql


SELECT DATE(st.ts) date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
10 rows affected.

[(datetime.date(2019, 10, 21), 549),
 (datetime.date(2019, 10, 14), 541),
 (datetime.date(2019, 10, 11), 539),
 (datetime.date(2019, 10, 29), 535),
 (datetime.date(2019, 10, 23), 535),
 (datetime.date(2019, 10, 10), 533),
 (datetime.date(2019, 10, 8), 532),
 (datetime.date(2019, 10, 22), 529),
 (datetime.date(2019, 10, 18), 528),
 (datetime.date(2019, 10, 15), 526)]

In [32]:
%%sql

-- channel 별 세션 아이디
SELECT channel, count(st.sessionID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
6 rows affected.

[('Facebook', 16791),
 ('Google', 16982),
 ('Instagram', 16831),
 ('Naver', 16921),
 ('Organic', 16904),
 ('Youtube', 17091)]

In [35]:
%%sql

SELECT COUNT(1)
FROM raw_data.user_session_channel 
WHERE channel ilike '%o%'
-- ilike 은 대소문자 무시

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
1 rows affected.

[(67768,)]

### 과제

In [20]:
# SQL로 MAU(Monthly Active User) 세보기

%%sql

-- DATE_FORMAT은 왜 안되는가 : Timestamp 타입이기 때문이다
-- DATE_FORMAT(DATE(st.ts), '%Y-%m') 은 왜 안되는지...?
-- 문자열로 바꿔서 그룹핑 
SELECT to_char(st.ts, 'YYYY-MM') date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1 DESC;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
7 rows affected.

[('2019-11', 721),
 ('2019-10', 763),
 ('2019-09', 639),
 ('2019-08', 662),
 ('2019-07', 623),
 ('2019-06', 459),
 ('2019-05', 281)]

In [29]:
%%sql

SELECT * FROM raw_data.session_timestamp st
limit 20;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
20 rows affected.

[('0002ac0d783338cfeab0b2bdbd872cda', datetime.datetime(2019, 7, 29, 12, 39, 41, 817000)),
 ('00053f5e11d1fe4e49a221165b39abc9', datetime.datetime(2019, 6, 24, 13, 4, 26, 370000)),
 ('00056c20eb5a029583db75506953f1d9', datetime.datetime(2019, 9, 26, 14, 50, 17)),
 ('00063cb5da1826febf178b669eea3250', datetime.datetime(2019, 10, 16, 14, 4, 42, 797000)),
 ('0007cda84fafdcf42f96c4f4adb7f8ce', datetime.datetime(2019, 5, 22, 8, 2, 29, 360000)),
 ('000c076c390a4c357313fca29e390ece', datetime.datetime(2019, 5, 2, 15, 24, 33, 963000)),
 ('000dd3543ac84d906eae52e7c779bb2a', datetime.datetime(2019, 8, 13, 15, 27, 51, 850000)),
 ('00106ac9184e7d54b570d0f0cb0c38b2', datetime.datetime(2019, 7, 25, 18, 14, 43, 37000)),
 ('0011df6282fe8cf78feeab676fbc3c27', datetime.datetime(2019, 11, 2, 21, 10, 41)),
 ('00126b47d5502dfb7d01f750ad23d813', datetime.datetime(2019, 6, 15, 15, 35, 48, 483000)),
 ('00129b07887a18a7331909231c28816e', datetime.datetime(2019, 10, 26, 13, 28, 39, 67000)),
 ('001a3678cacf4ea11a20f88a8ea80cea', datetime.datetime(2019, 10, 4, 19, 57, 0, 907000)),
 ('001bf9e1206bf15adc0bef185ce3442f', datetime.datetime(2019, 9, 20, 19, 53, 38, 440000)),
 ('001c051f536279e94d0902528a70187d', datetime.datetime(2019, 10, 16, 0, 31, 2, 730000)),
 ('001c728a3046207c685f7f478f4bb41b', datetime.datetime(2019, 6, 27, 16, 12, 57, 657000)),
 ('001d507e80c4e4d2ce4ba0a5590f8313', datetime.datetime(2019, 10, 12, 19, 15, 38, 547000)),
 ('001d908c7637618bb0a8af0c8be5cd41', datetime.datetime(2019, 7, 13, 13, 33, 52, 163000)),
 ('001f35b87b35111bcaf1087426d2884e', datetime.datetime(2019, 8, 5, 1, 17, 22, 403000)),
 ('001fca6b304504b620c727b498b2d814', datetime.datetime(2019, 8, 21, 16, 52, 18, 307000)),
 ('0020194058e082c8b253eadc35c9ba31', datetime.datetime(2019, 11, 22, 1, 2, 24))]

In [31]:
%%sql
-- 아래의 코드는 왜 에러가 나는 것일까요?
SHOW databases;
DESC raw_data.session_timestamp st;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
(psycopg2.errors.SyntaxError) syntax error at or near ";"
LINE 1: SHOW databases;
                      ^

[SQL: SHOW databases;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [41]:
# SQL로 MAU(Monthly Active User) 세보기

%%sql

SELECT DATE(st.ts) date, COUNT(DISTINCT usc.userID)
FROM raw_data.session_timestamp st
JOIN raw_data.user_session_channel usc ON st.sessionID = usc.sessionID
GROUP BY 1
ORDER BY 1 DESC
lIMIT 20;

 * postgresql://guest:***@learnde.cduaw970ssvt.ap-northeast-2.redshift.amazonaws.com:5439/dev
20 rows affected.

[(datetime.date(2019, 11, 30), 460),
 (datetime.date(2019, 11, 29), 444),
 (datetime.date(2019, 11, 28), 413),
 (datetime.date(2019, 11, 27), 500),
 (datetime.date(2019, 11, 26), 504),
 (datetime.date(2019, 11, 25), 508),
 (datetime.date(2019, 11, 24), 451),
 (datetime.date(2019, 11, 23), 469),
 (datetime.date(2019, 11, 22), 496),
 (datetime.date(2019, 11, 21), 504),
 (datetime.date(2019, 11, 20), 517),
 (datetime.date(2019, 11, 19), 506),
 (datetime.date(2019, 11, 18), 521),
 (datetime.date(2019, 11, 17), 470),
 (datetime.date(2019, 11, 16), 479),
 (datetime.date(2019, 11, 15), 515),
 (datetime.date(2019, 11, 14), 520),
 (datetime.date(2019, 11, 13), 515),
 (datetime.date(2019, 11, 12), 517),
 (datetime.date(2019, 11, 11), 518)]

판다스와 연동하는 방법

In [ ]:
result = %sql SELECT * FROM raw_data.user_session_channel
df = result.DataFrame()

In [ ]:
df.head()

In [ ]:
df.groupby(["channel"]).size()

In [ ]:
df.groupby(["channel"])["sessionid"].count()

In [ ]:
result = %sql SELECT * FROM raw_data.session_timestamp
df_st = result.DataFrame()

In [ ]:
df_st['date'] = df_st['ts'].apply(lambda x: "%d-%02d-%02d" % (x.year, x.month, x.day))

In [ ]:
df_st.head()

In [ ]:
df_st.groupby(["date"]).size()  # .sort_values(["date"])

In [ ]:
df_st.groupby(["date"])["sessionid"].count().reset_index(name='count').sort_values("date", ascending=False)